; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	spectrograph1 - mode
	thermograph0 - mode
	thermograph2 - mode
	GroundStation0 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation6 - direction
	Star3 - direction
	Star5 - direction
	Star7 - direction
	GroundStation1 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 Star7)
	(supports instrument3 thermograph0)
	(supports instrument3 thermograph2)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star3)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon12)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 thermograph2)
	(supports instrument6 spectrograph1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation6)
	(calibration_target instrument6 Star3)
	(supports instrument7 spectrograph1)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star3)
	(calibration_target instrument7 Star5)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
	(supports instrument8 spectrograph1)
	(supports instrument8 thermograph0)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 GroundStation1)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 Star7)
	(calibration_target instrument9 Star5)
	(supports instrument10 thermograph2)
	(supports instrument10 thermograph0)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 GroundStation1)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star14)
)
(:goal (and
	(pointing satellite0 Star14)
	(pointing satellite2 Star5)
	(have_image Star8 spectrograph1)
	(have_image Star9 thermograph2)
	(have_image Planet10 spectrograph1)
	(have_image Star11 thermograph0)
	(have_image Phenomenon12 thermograph2)
	(have_image Phenomenon13 spectrograph1)
	(have_image Star14 thermograph0)
))

)

; plan
1. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 9
2. (calibrate satellite2 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 0 of 9
3. (turn_to satellite2 star11 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 star11)
   goals met: 0 of 9
4. (take_image satellite2 star11 instrument3 thermograph0)
   added: (have_image star11 thermograph0)
   goals met: 1 of 9
5. (turn_to satellite2 planet10 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 planet10)
   goals met: 1 of 9
6. (take_image satellite2 planet10 instrument3 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 2 of 9
7. (turn_to satellite2 phenomenon13 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon13)
   goals met: 2 of 9
8. (take_image satellite2 phenomenon13 instrument3 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 3 of 9
9. (turn_to satellite2 phenomenon12 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon12)
   goals met: 3 of 9
10. (turn_to satellite0 star14 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star14)
   goals met: 4 of 9
11. (take_image satellite2 phenomenon12 instrument3 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 5 of 9
12. (turn_to satellite2 star14 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star14)
   goals met: 5 of 9
13. (take_image satellite2 star14 instrument3 thermograph0)
   added: (have_image star14 thermograph0)
   goals met: 6 of 9
14. (turn_to satellite2 star8 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star8)
   goals met: 6 of 9
15. (take_image satellite2 star8 instrument3 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 7 of 9
16. (turn_to satellite2 star9 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star9)
   goals met: 7 of 9
17. (take_image satellite2 star9 instrument3 thermograph2)
   added: (have_image star9 thermograph2)
   goals met: 8 of 9
18. (turn_to satellite2 star5 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 star5)
   goals met: 9 of 9
